Repository: OpenChain-Project/Specification-Translation-JP
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Section 2 introduces definitions of key terms used throughout the specification.
ja: 第2節では、本資料全般で用いられる重要用語について定義します。

source: Section 3 presents the specification requirements where each one has a list of one or more Verification Artifacts.
ja: 第3節では、仕様としての要件を示します。それぞれに1つ以上の「 検証すべき証跡（Verification Artifact）」があります。

source: Section 3 presents the specification requirements where each one has a list of one or more Verificatione Artifacts.
ja: 第3節では、仕様としての要件を示していきます。それぞれに一つ以上の「証跡」があります。

source: Software Staff - any employee or contractor that defines, contributes to or has responsibility for preparing Supplied Software.
ja: ソフトウェア スタッフ－供給ソフトウェアについて、定義し、コントリビュートし、もしくは使えるよう準備する責任を持つ従業員や契約者のこと。

source: Software Staff must have completed FOSS training within the last 24 months (to be considered current).
ja: ソフトウェア スタッフは、FOSSトレーニングを過去24か月以内に（最新の状況に即すとみなされるよう）修了していること。

source: Software Staff roles and responsibilities pertaining to FOSS compliance specifically and the FOSS policy in general; and
ja: FOSSコンプライアンスに具体的に関係し、FOSSポリシー全般に関係するソフトウェア スタッフの役割と責任

source: Supplied Software - software that an organization delivers to third parties (e.g., other organizations or individuals).
ja: 供給ソフトウェア（Supplied Software）－組織が第三者（他組織または個人）に対して提供するソフトウェアのこと。

source: Supplied Software – software that an organization delivers to third parties (e.g., other organizations or individuals).
ja: 供給ソフトウェア（Supplied Software）－組織が第三者（他組織または個人）に対して提供するソフトウェアのこと。

source: That a procedure exists to support this activity and that the procedure is followed.
ja: そしてその活動を支援する手続きが存在し、その手続きに従っていることを確かなものにします。

source: The FOSS Compliance role and the FOSS Liaison can be the same individual.
ja: 本FOSSコンプライアンスを履行する役割とFOSS窓口は同じ担当者が兼務することができます。

source: The FOSS Compliance role and the FOSS Liaison may be the same individual.
ja: 本FOSSコンプライアンスを履行する役割とFOSS窓口は同じ担当者が兼務することができる。

source: The FOSS contribution policy can be made a part of the overall FOSS policy of an organization or be its own separate policy.
ja: FOSSコントリビューション ポリシーは、組織全体のFOSSポリシーの一部として策定することも、独立したポリシーとして策定することも可能です。

source: The FOSS management program must be capable of handling common FOSS license use cases encountered by Software Staff for Supplied Software, which may include the following use cases (note that the list is neither exhaustive, nor may all of the use cases apply):
ja: FOSSのマネジメント プログラムは、ソフトウェア スタッフが扱う供給ソフトウェアの共通的なFOSSユースケースに対応できること。共通的ユースケースとして以下のようなものがある（ただしこのリストは網羅的ではなく、組織によっては当てはまらないこともある）。

source: The FOSS policy and where to find a copy;
ja: FOSSポリシーおよびそれがどこで見つけられるか

source: The FOSS program must be capable of handling typical FOSS use cases encountered by Software Staff for Supplied Software, which may include the following use cases - when parts of the Supplied Software (note that the below list is neither exhaustive, nor may all of the below use cases apply depending on the organization):
ja: FOSSコンプライアンス プログラムは、ソフトウェア スタッフが扱う供給ソフトウェアの代表的なFOSSユースケースに対応できること。代表的ユースケースでは、供給ソフトウェアの一部が以下のように扱われている （ただしこれらのリストは網羅的ではない。また組織によっては以下のユースケースが当てはまらないこともある）。

source: The OpenChain Initiative began in 2013 when a group of software supply chain open source practitioners observed two emerging patterns: 1) significant process similarities existed among organizations with mature open source compliance programs; and 2) there still remained a large number of organizations exchanging software with less developed programs.
ja: OpenChain イニシアチブは2013年に開始されました。当時ソフトウェア サプライチェーンでオープンソースを活用していた実務者グループは、オープンソース コンプライアンスに関して2つのパターンを見出していました。それは、1）成熟したオープンソース コンプライアンス プログラムを持つ組織のプロセスには顕著な類似性があること、および、2）いまだに多くの組織が遅れたコンプライアンス プログラムでソフトウェアをやりとりしていること、です。

source: The Vision and Mission of the OpenChain Initiative are as follows:
ja: OpenChainイニシアチブのビジョンとミッションは以下のとおりです。

source: The details of the policy and available translations can be found on the OpenChain project specification webpage.
ja: そのポリシーおよび入手可能な翻訳版の詳細については、OpenChain仕様のWebページでご確認ください。

source: The intent is to ensure a core base level set of topics are covered but a typical training program would likely be more comprehensive than what is required here.
ja: ここで意図しているのは、一連の中核的な基本レベルのトピックがカバーされることですが、通常実施されているトレーニング プログラムでは、ここで求められる内容より包括的なものになると考えられます。

source: The latter observation resulted in a lack of trust in the consistency and quality of the compliance artifacts accompanying the software being exchanged.
ja: 後者の実態は、やりとりするソフトウェアに付随したコンプライアンス関連資料の一貫性や品質に対する信頼を喪失させました。

source: The mere meeting of a subset of these requirements would not be considered sufficient to warrant a program be OpenChain certified.
ja: これらの要件に部分的に準拠しているだけではOpenChain適合認定を保証するに十分なものとはみなされません。

source: The organization affirms that a FOSS management program exists that meets all the requirements of this OpenChain Specification version 1.1 within the past 18 months of achieving conformance validation.
ja: 本OpenChain仕様書第1.1版の要件すべてを満たし、過去18ヶ月以内に適合認定を達成したFOSSマネジメント プログラムがその組織に存在することを確認する。

source: The organization affirms that a FOSS management program exists that meets all the requirements of this OpenChain Specification version 1.1.
ja: その組織に本OpenChain仕様書第1.1版のすべての要件を満たしたFOSSマネジメント プログラムが存在することを確認する。

source: The organization affirms that a program exists that meets all the requirements of this OpenChain Conformance Specification version 1.0.
ja: その組織に本OpenChain適合仕様書第1.0版の要件を満たしたコンプライアンス プログラムが存在することを確認する。

source: The policy must be internally communicated.
ja: またそのポリシーは組織内に周知されていなければならない。

source: The recorded inventory also serves as evidence that the process was followed.
ja: 一覧表の記録は、そのプロセスが実行されたことを示す確証として機能します。

source: The requirements represent a base level (minimum) set of requirements a program must satisfy to be considered OpenChain Conforming.
ja: 本要件は、そのコンプライアンス プログラムがOpenChainに適合しているとみなされるために満足しなければならない基本レベル（最低限）の要件一式を提示するものです。

source: The specification focuses on the “what” and “why” qualities of a compliance program as opposed to the “how” and “when” considerations.
ja: 本仕様書は、コンプライアンス プログラムの「何（What）」や「なぜ（Why）」の属性に焦点をあてており、「どのように（How）」や「いつ（When）」といった考慮点には言及していません。

source: The specification is licensed under the Creative Commons Attribution License 4.0 (CC-BY-4.0).
ja: 本仕様書の利用は、Creative Commons Attribution License 4.0ライセンスに基づき許諾されます。

source: The study group evolved into a work group, and in April 2016, formally organized as a Linux Foundation collaborative project.
ja: 本グループはワーキング グループへと発展し、その後2016年4月に正式にLinux Foundation協業プロジェクトとして組織されました。

source: The training, as a minimum, covers the following topics:
ja: トレーニングは少なくとも以下に示すトピックを含んでいること。

source: The training, at a minimum, covers the following topics:
ja: トレーニングは少なくとも以下に示すトピックを含んでいること。

source: They include (but are not limited to) the following: copyright notices, copies of licenses, modification notifications, attribution notices, source code, written offers and so forth.
ja: 著作権表示（Copyright notice）、ライセンスのコピー、改変告知（Modification notification）、帰属告知（Attribution notice）、ソースコード、書面による申し出（Written offer）などを含む。

source: They represent the evidence that must exist in order for a given requirement to be considered satisfied.
ja: これらは示された要件が満たされているかどうかを確認するために存在しなくてはならない確証としての役割を果たしています。

source: This document is licensed under the Creative Commons Attribution 4.0 International (CC-BY 4.0) license.
ja: 本仕様書の利用は、Creative Commons Attribution 4.0 International (CC-BY 4.0) ライセンスの下で許諾されます。

source: This ensures a practical level of flexibility that enables different organizations to tailor their policies and processes to best fit their objectives.
ja: このため実用的レベルで柔軟性があり、さまざまな組織が自社の目的に最適なポリシーやプロセスを作成することができます。

source: This inventory must exist to support the systematic review of each component’s license terms to understand their respective distribution obligations and restrictions applicable to the Supplied Software.
ja: この一覧表 は、供給ソフトウェアに適用される頒布上の義務や制約を理解し、各コンポーネントのライセンス条項の体系的レビューをサポートする上でに必須となります。

source: This requirement ensures that the program’s supporting processes and controls do not erode if they want to continue to assert conformance with the specification overtime.
ja: 本要件は、組織が本仕様書への適合を一定期間超えて主張し続けたい場合においてそのプログラムが支えているプロセスや統制機能が損なわれていないことを確かなものにします。

source: This set is referred to as the Compliance Artifacts which may include (but are not limited to) one or more of the following: source code, attribution notices, copyright notices, copy of licenses, modification notifications, written offers, SPDX documents and so forth.
ja: この生成物一式はコンプライアンス関連資料として次の一つ、もしくは複数のもの（ただし、この限りではない）：ソースコード、帰属告知（Attribution notice）、著作権表示（Copyright notice）、ライセンスの写し、改変告知（Modification notification）、書面による申し出（Written offer）、SPDXドキュメントなど

source: Time to perform the role has been allocated; and
ja: 職務を遂行するための時間が割り当てられている。

source: To cause the FOSS program to be sufficiently robust to address that organization’s typical use cases as a result of that organization’s business practices.
ja: そのFOSSプログラムが組織の業務遂行上生じる代表的なユースケースに対応できるよう十分堅固なものにします。

source: To ensure a process exists for creating and managing a FOSS component bill of materials used to construct the Supplied Software.
ja: 供給ソフトウェアを構成するために使用されるFOSSコンポーネントの部品表（Bill of material）を作り、管理するためのプロセスが存在することを確かなものにします。

source: To ensure a process exists for identifying and listing all FOSS components used to construct the Supplied Software.
ja: 供給ソフトウェアを構成 するために用いられるすべてのFOSSコンポーネントを特定およびリスト化するためのプロセスが存在することを確かなものにします。

source: To ensure a process exists for reviewing and identifying the license obligations for each Identified License for the various use cases.
ja: 確認ライセンスそれぞれについてレビューし、さまざまなユースケースに対するライセンスの義務を明確化するプロセスが存在することを確かなものにします。

source: To ensure that if an organization declares that it has a program that is OpenChain Conforming,
ja: 組織がOpenChainに適合しているプログラムを有していることを宣言した場合に、

source: To ensure that if an organization declares that it has a program that is OpenChain Conforming, that such program has met all the requirements of this specification.
ja: 組織がOpenChainに適合したプログラムを有していると宣言した場合、当該プログラムが本仕様書のすべての要件を満たしていることを確かなものにします。

source: To ensure the program is sufficiently robust to handle an organization’s common FOSS license use cases.
ja: そのプログラムが組織における共通的なFOSSライセンスのユースケースに対応できるよう十分堅固なものにします。

source: To facilitate global adoption we welcome efforts to translate the specification into multiple languages.
ja: 本仕様書がグローバルに採用されることを促進するために、私たちは本仕様書を多言語に翻訳する取り組みを歓迎します。

source: Verification Artifact(s):
ja: 検証すべき証跡：

source: Verification Artifacts - evidence that must exist in order for a given requirement to be considered satisfied.
ja: 検証すべき証跡（Verification Artifact）－与えられた要件を満足しているとみなされるために存在しなければならない確証のこと。

source: Verification Artifacts are not intended to be public, but could be provided under NDA or upon private request from the OpenChain organization to validate conformance.
ja: 「 検証すべき証跡（Verification Artifact）」は、公開を意図したものではありませんが、OpenChain適合を認定する機関による非公開の要請や守秘義務契約（NDA）のもとで提供されることがあります。

source: Version 1.0
ja: 第1.0版

source: Version 1.1
ja: 第 1.1 版

source: Vision: A software supply chain where free/open source software (FOSS) is delivered with trusted and consistent compliance information.
ja: ビジョン： フリー／オープンソース ソフトウェア（FOSS）が、信頼性と一貫性のあるコンプライアンス情報とともに提供されるソフトウェア サプライチェーンを実現すること。

source: Vision: A software supply chain where free/open source software (FOSS) is delivered with trustworthy and consistent compliance information.
ja: ビジョン：フリー／オープンソース ソフトウェア（FOSS）が、信頼性と一貫性のあるコンプライアンス情報とともに提供されるソフトウェア サプライチェーンを実現すること。

source: adherence to project-specific contribution requirements
ja: プロジェクト固有のコントリビューション要件の遵守

source: are distributed in binary form
ja: バイナリ形態で頒布されている

source: are distributed in source form
ja: ソースコード形態で頒布されている

source: are integrated with other FOSS such that it may trigger copyleft obligations
ja: コピーレフトの義務を生じうる他のFOSSと統合されている

source: attribution notices
ja: 帰属告知（Attribution notice）

source: business rationale or approval
ja: ビジネス観点での合理的根拠、もしくは承認

source: community engagement and interaction, including a project’s Code of Conduct or equivalent
ja: コミュニティへの積極的参加および関わり方。たとえばプロジェクトの行動規範（Code of Conduct）もしくはそれと同等のものなど

source: contains FOSS or other software under an incompatible license interacting with other components within the Supplied Software; and/or
ja: 供給ソフトウェア内の他のコンポーネントとやりとりする、両立性 のないライセンス下のFOSSやその他のソフトウェアを含んでいる

source: contains FOSS or other software under an incompatible license interacting with other
ja: FOSSもしくは互換性

source: contains FOSS or other software under an incompatible license interacting with other components within the Supplied Software
ja: 供給ソフトウェア内の他のコンポーネントとやりとりする、両立性 のないライセンス下のFOSSやその他のソフトウェアを含んでいる

source: contains FOSS with attribution requirements
ja: 帰属要求（Attribution requirement）のあるFOSSを含んでいる

source: contains FOSS with attribution requirements.
ja: もしくは、帰属要求（Attribution requirement）のあるFOSSを含んでいる

source: contains modified FOSS
ja: 改変されたFOSSを含んでいる

source: contains modified FOSS;
ja: 改変されたFOSSを含んでいる

source: copies of Identified Licenses
ja: 確認ライセンスの写し

source: copyright notices
ja: 著作権表示（Copyright notice）

source: distributed in binary form;
ja: バイナリ形態で頒布されている

source: distributed in source form;
ja: ソースコード形態で頒布されている

source: integrated with other FOSS such that it may trigger copyleft obligations;
ja: コピーレフトの義務を生じうる他のFOSSと統合されている

source: legal approval for license considerations
ja: ライセンスに関する検討結果に対する法務面での承認

source: modification notifications
ja: 改変告知（Modification notification）

source: prominent notices
ja: 重要事項の告知（Prominent notice）

source: required build instructions and scripts
ja: 必要なビルド手順とスクリプト

source: source code
ja: ソースコード

source: technical review of code to be contributed
ja: コントリビューションの対象となるコードの技術的レビュー

source: written offers
ja: 書面による申し出（Written offer）
